Repository: noraminrazak/i3swebapiv2
Catalog: I3SwebAPIv2/Resources/WebApiResources.*.resx
Languages: ms

source: Absent
ms: Tidak Hadir

# AccountAlreadyVerify
source: Your account has been verified. Please login to continue.
ms: Akaun anda telah disahkan. Sila daftar masuk untuk meneruskan.

# AccountDeleteSuccess
source: Account deleted successfully. You will be logged out automatically.
ms: Akaun berjaya dipadamkan. Anda akan dilog keluar secara automatik.

# AccountNotFound
source: Your account could not be found.
ms: Akaun anda tidak dapat ditemui.

# AccountVerifySuccess
source: Your account has been verified. Please change your card PIN.
ms: Akaun anda telah disahkan. Sila tukar PIN kad anda.

# AccountVerifySuccessMerchant
source: Your account has been verified. Please login to continue.
ms: Akaun anda telah disahkan. Sila daftar masuk untuk meneruskan.

# AttUploadSuccess
source: Attachment successfully uploaded.
ms: Lampiran berjaya dimuat naik.

# AwaitingVerificationMpay
source: Your documents are awaiting verification. Please check your email for status update.
ms: Dokumen anda sedang diproses. Sila semak emel anda untuk makluman status terkini.

# BadRequestText
source: 400 - Bad Request
ms: 400 - Permintaan tidak sah

# CardLimitUpdateSuccess
source: Card daily limit successfully updated.
ms: Had harian kad berjaya dikemas kini.

# CardPinChangeSuccessText
source: Pin number changed successfully. Please login using your MyKad / Passport number as Username to proceed.
ms: Nombor pin berjaya ditukar. Sila daftar masuk menggunakan nombor MyKad / Passport sebagai Nama Pengguna untuk meneruskan.

# CardReplaceSuccess
source: Card has successfully been replaced.
ms: Kad berjaya diganti.

# CardStatusAlreadyBlacklist
source: Card status already blacklisted.
ms: Status kad sudah disenarai hitam.

source: Card status not active.
ms: Kad status tidak aktif.

# CardStatusUpdateSuccess
source: Card status successfully updated.
ms: Status kad berjaya dikemas kini.

source: Category Name
ms: Nama Kategori

# ChannelAlreadyJoin
source: You already joined this channel.
ms: Anda sudah menyertai saluran ini.

# ChannelJoinSuccess
source: Channel successfully joined.
ms: Saluran berjaya disertai.

# ChannelLeaveSuccess
source: You already left this channel.
ms: Anda sudah meninggalkan saluran ini.

# ClassAttendanceReportNotFound
source: Class attendance report could not be found.
ms: Laporan kehadiran kelas tidak dijumpai.

# ClassAttendanceReportSuccess
source: Class attendance report successfully exported.
ms: Laporan kehadiran class berjaya dieksport.

# ClassDailyOrderReportTitle
source: Class Daily Order Report
ms: Laporan Pesanan Harian Kelas

source: Class Name
ms: Nama Kelas

# ClassOrderReportNotFound
source: Class daily order report could not be found.
ms: Laporan pesanan harian kelas tidak dijumpai.

# ClassOrderReportSuccess
source: Class daily order report successfully exported.
ms: Laporan pesanan harian kelas berjaya dieksport.

# ClassRelationshipCreateSuccess
source: Class relationship successfully created.
ms: Hubungan kelas berjaya dicipta.

# ClassRelationshipExist
source: Class relationship already exists.
ms: Hubungan kelas sudah didaftarkan.

# ClassRelationshipNotFound
source: Class relationship could not be found.
ms: Hubungan kelas tidak dijumpai.

# ClassRelationshipRemoveSuccess
source: Class relationship successfully removed.
ms: Hubungan kelas berjaya dikeluarkan.

# ClassStudentExist
source: Student already enrolled into the class.
ms: Pelajar sudah didaftarkan ke dalam kelas.

# ClassTeacherExist
source: Class teacher already exist. full_name is the current class teacher.
ms: Guru kelas sudah didaftarkan. full_name adalah guru kelas semasa.

# ClubAttAlreadyExist
source: Club attendance already exists.
ms: Kehadiran kelab sudah didaftarkan.

# ClubAttCreatedSuccess
source: Club attendance created successfully.
ms: Kehadiran kelab berjaya dicipta.

# ClubHandoverSuccess
source: Club successfully handed over.
ms: Kelab berjaya diserahkan.

# ClubMemberExist
source: Club member already exists.
ms: Ahli kelab sudah didaftarkan.

# ClubMemberNotFound
source: Club member could not be found.
ms: Ahli kelab tidak dijumpai.

# ClubMemberRemoveSuccess
source: Club member successfully removed.
ms: Ahli kelab berjaya dkeluarkan.

# ClubRelationshipCreateSuccess
source: Club relationship successfully created.
ms: Hubungan kelab berjaya dicipta.

# ClubRelationshipExist
source: Club relationship already exists.
ms: Hubungan kelab sudah didaftarkan.

# ClubRelationshipNotFound
source: Club relationship could not be found.
ms: Hubungan kelab tidak dijumpai.

# ClubRelationshipRemoveSuccess
source: Club relationship successfully removed.
ms: Hubungan kelab berjaya dikeluarkan.

source: Company Name
ms: Nama Kedai

# CustomerDocumentRejected
source: Customer document rejected, please resubmit through i-3s mobile app to proceed.
ms: Dokumen pelanggan ditolak, sila serahkan semula melalui aplikasi mudah alih i-3s untuk meneruskan.

# CustomerRejected
source: Customer rejected, please contact call center for further detail.
ms: Pelanggan ditolak, sila hubungi pusat panggilan untuk butiran lanjut.

source: Delivery
ms: Penghantaran

# DocumentResubmitSuccess
source: Document successfully submitted
ms: Dokumen berjaya diserahkan

# EmailInvalid
source: Email format invalid.
ms: Format e-mel tidak sah.

source: Enter
ms: Masuk

# ErrorOccured
source: An error has occured, please try again.
ms: Ralat telah berlaku, sila cuba lagi.

source: Excused
ms: Bersebab

# FailToSendEmail
source: Failed to send email.
ms: Gagal menghantar e-mel.

# ForbiddenText
source: 403 - Forbidden
ms: 403 - Permintaan dilarang

# IdentityNoInvalid
source: Identity number is invalid.
ms: Nombor identiti tidak sah.

# IdentityNumberAlreadyExist
source: Identity number already registered.
ms: Nombor pengenalan sudah didaftarkan.

# ImageUploadSuccess
source: Image successfully uploaded.
ms: Imej berjaya dimuat naik.

# InCaseLostStolenCard
source: In case of a lost or stolen card, please report a lost/stolen card first before you request for a card replacement. This will minimize the chances of losing your eWallet balance.
ms: Sekiranya kad hilang atau dicuri, sila lapor kehilangan/kecurian kad terlebih dahulu sebelum anda membuat penggantian kad. Ini dapat mengurangkan peluang kehilangan baki eWallet anda.

# IncorrectUsername
source: Your Username is incorrect or you are not yet registered.
ms: Nama Pengguna anda tidak tepat atau masih belum berdaftar.

source: Insufficient wallet balance.
ms: Baki e-Wallet tidak mencukupi.

# InternalServerErrorText
source: 500 - Internal Server Error
ms: 500 - Ralat komputer pelayar

source: Invalid amount.
ms: Amaun tidak sah.

# InvalidRecipientWalletNo
source: Invalid recipient wallet number.
ms: Nombor e-Wallet penerima tidak sah.

# InvalidWalletNo
source: Invalid e-Wallet number.
ms: Nombor e-Wallet tidak sah.

source: Late
ms: Lewat

# MaxOTPTryout
source: Maximum OTP tryout limit exceeded.
ms: Had penggunaan OTP maksimum melebihi.

# MobileNoInvalid
source: Mobile number is invalid.
ms: Nombor mudah alih tidak sah.

source: Month
ms: Bulan

source: Monthly Attendance Report
ms: Laporan Kehadiran Bulanan

# NewCardNotFound
source: New card not found! Please enter a valid new card number.
ms: Kad baru tidak dijumpai! Sila masukkan nombor kad baru yang sah.

# NewChairmanMustBeMember
source: New chairman must be a member of this club.
ms: Pengerusi baru mestilah salah seorang ahli kelab.

# NewClassStudentCreateSuccess
source: Student have been successfully enrolled into the class.
ms: Pelajar telah berjaya didaftarkan ke dalam kelas.

# NewClubMemberCreateSuccess
source: New club member successfully created.
ms: Ahli kelab baru berjaya dicipta.

# NewPostCreateSuccess
source: New bulletin successfully created.
ms: Buletin baru berjaya dicipta.

# NewRegistrationText
source: New registration
ms: Pendaftaran baru

source: No.
ms: Bil.

# NoRecordFoundText
source: No record found.
ms: Tiada rekod ditemui.

source: No status
ms: Tiada status

# NotFoundText
source: 404 - Not Found
ms: 404 - Destinasi tidak ditemui

source: Order Date
ms: Tarikh Pesanan

# OrderHistoryRemoved
source: Your order history has been removed.
ms: Sejarah pesanan anda telah dikeluarkan.

# OrderHistoryUpdate
source: Your order history has been placed in the cart.
ms: Sejarah pesanan anda telah dimasukkan ke dalam troli.

# OrderMustBePlacedBfor7
source: Same-day online orders must be placed before 7:00 AM. Please remove your order for today to continue payment.
ms: Pesanan dalam talian pada hari yang sama mesti dibuat sebelum 7:00 AM. Sila alih keluar pesanan anda untuk hari ini untuk meneruskan pembayaran.

# OrderStatusUpdateSuccess
source: Order status successfully updated.
ms: Status pesanan berjaya dikemaskini.

source: Order Timing
ms: Masa Pesanan

# OTPHasBeenSent
source: OTP has been sent to
ms: OTP telah dihantar kepada

source: OTP has expired.
ms: OTP telah tamat tempoh.

# ParentIDAlreadyExist
source: Your Identity Number has been registered as a parent.
ms: Nombor identiti anda telah didaftarkan sebagai ibubapa.

# ParentStudentRelationshipCreateSuccess
source: Parent-student relationship successfully created.
ms: Hubungan ibu bapa-pelajar berjaya dicipta.

# ParentStudentRelationshipExist
source: Parent-student relationship already exists.
ms: Hubungan ibu bapa-pelajar sudah didaftarkan.

# PendingActivation
source: Pending customer activation
ms: Menunggu pengaktifan pelanggan

# PhotoSuccessRemove
source: Photo successfully removed.
ms: Foto berjaya dikeluarkan.

# PleaseCheckYourEmail
source: Please check your email for reset password link.
ms: Sila periksa e-mel anda untuk menetapkan semula kata laluan.

# PleaseCreateNewPassword
source: Please create your new password.
ms: Sila cipta kata laluan baru anda.

# PleaseEnterValidEmail
source: Please enter a valid email address.
ms: Sila masukkan alamat emel yang sah.

# PleaseUploadYourImage
source: Please upload your MyKad / Passport image and your selfie image for verification process.
ms: Sila muat naik imej MyKad / Pasport dan imej selfie anda untuk proses pengesahan.

# PlsClearWalletBalance
source: Please clear the balance in student wallet.
ms: Sila kosongkan baki dalam e-Wallet pelajar.

# PlsCreateNewPswd
source: Please create your new password.
ms: Sila cipta kata laluan baru.

# PlsEnterPswd
source: Please enter your password.
ms: Sila masukkan kata laluan.

# PostSuccessRemove
source: Bulletin successfully removed.
ms: Bulletin berjaya dikeluarkan.

# PostUpdateSuccess
source: Bulletin successfully updated.
ms: Bulletin berjaya dikemaskini.

source: Prepared By
ms: Disediakan oleh

source: Present
ms: Hadir

source: Printed Date/Time
ms: Tarikh/Masa dicetak

# ProductCategoryCreateSuccess
source: Product category successfully created.
ms: Kategori produk berjaya dicipta.

# ProductCategoryDeleteSuccess
source: Product category successfully deleted.
ms: Kategori produk berjaya dikeluarkan.

# ProductCategoryExist
source: Product category already exists.
ms: Kategori produk sudah didaftarkan.

# ProductCategoryUpdateSuccess
source: Product category successfully updated.
ms: Kategori produk berjaya dikemas kini.

source: Product Daily Order Report
ms: Laporan Pesanan Harian Produk

# ProductDetailCreateSuccess
source: Product detail successfully created.
ms: Butiran produk berjaya dicipta.

# ProductDetailDeleteSuccess
source: Product detail successfully deleted.
ms: Butiran produk berjaya dikeluarkan.

# ProductDetailExist
source: Product detail already exists.
ms: Butiran produk sudah didaftarkan.

# ProductDetailUpdateSuccess
source: Product detail successfully updated.
ms: Butiran produk berjaya dikemas kini.

source: Product Name
ms: Nama Produk

# ProductOrderReportNotFound
source: Product daily order report could not be found.
ms: Laporan pesanan harian produk tidak dijumpai.

# ProductOrderReportSuccess
source: Product daily order report successfully exported.
ms: Laporan pesanan harian produk berjaya dieksport.

# ProfileUpdateSuccess
source: Your profile has been updated.
ms: Profil anda telah dikemaskini.

# PswdNotMatch
source: Password does not match.
ms: Kata laluan tidak sama.

# PswdUpdateSuccess
source: Password successfully updated.
ms: Kata laluan berjaya dikemaskini.

# ReceiveOrder
source: We have received your order.
ms: Kami telah menerima pesanan anda.

# RegisterDoubleRole
source: You account has been registered as a staff before. Would you like to register as a parent / guardian as well?
ms: Anda telah berjaya mendaftar sebagai kakitangan sebelum ini. Adakah anda ingin mendaftar sebagai ibu bapa / penjaga juga?

# RegisterSuccess
source: You account has been registered. Please login using your MyKad / Passport number as Username to proceed.
ms: Anda telah berjaya mendaftar. Sila log masuk menggunakan nombor MyKad / Pasport anda sebagai Nama Pengguna untuk meneruskan.

source: Report
ms: Laporan

# RequestTimeoutText
source: 408 - Request Timeout
ms: 408 - Permintaan tamat masa

# SchoolClubExist
source: Club name already exists.
ms: Nama kelab sudah didaftarkan.

# SchoolClubSaveSuccess
source: New club successfully created.
ms: Kelab baru berjaya dicipta.

source: School Name
ms: Nama Sekolah

source: Self Pick-up
ms: Ambil sendiri

source: Service Method
ms: Kaedah Perkhidmatan

# ServiceTemporaryDown
source: Service is temporarily unavailable due to maintenance. Please try again later.
ms: Perkhidmatan tidak tersedia buat sementara waktu kerana penyelenggaraan. Sila cuba sebentar lagi.

# ShiftCode
source: Session Code
ms: Kod Sesi

# SomethingWentWrong
source: Something went wrong. Please try again later.
ms: Ada sesuatu yang tidak kena. Sila cuba sebentar lagi.

# SorryAccNotActive
source: Sorry, your account is not active.
ms: Maaf, akaun tidak aktif.

# SorryAccountInactive
source: Sorry, your account is not active.
ms: Maaf, akaun anda tidak aktif.

# StaffAttendanceReportNotFound
source: Staff attendance report could not be found.
ms: Laporan kehadiran kakitangan tidak dijumpai.

# StaffAttendanceReportSuccess
source: Staff attendance report successfully exported.
ms: Laporan kehadiran kakitangan berjaya dieksport.

# StaffAttNotFound
source: Staff attendance could not be found.
ms: Kehadiran kakitangan tidak dijumpai.

# StaffAttUpdateSuccess
source: Staff attendance successfully updated.
ms: Kehadiran kakitangan berjaya dikemas kini.

# StaffDailyOrderReportTitle
source: Staff Daily Order Report
ms: Laporan Pesanan Harian Kakitangan

source: Staff Name
ms: Nama Kakitangan

# StaffNotFound
source: Staff could not be found.
ms: Kakitangan tidak dapat ddijumpai.

# StaffOrderReportNotFound
source: Staff daily order report could not be found.
ms: Laporan pesanan harian kakitangan tidak dijumpai.

# StaffOrderReportSuccess
source: Staff daily order report successfully exported.
ms: Laporan pesanan harian kakitangan berjaya dieksport.

# StaffRemoveSuccess
source: Staff successfully removed.
ms: Kakitangan berjaya dikeluarkan.

# StaffShiftExist
source: Staff shift already exists.
ms: Waktu kerja kakitangan sudah didaftarkan.

# StaffShiftUpdateSuccess
source: Staff shift successfully updated.
ms: Waktu kerja kakitangan berjaya dikemas kini.

# StatusUpdateSuccess
source: Status successfully updated.
ms: Status berjaya dikemas kini.

# StudentAccUpdateSuccess
source: Student account successfully updated.
ms: Akaun pelajar berjaya dikemas kini.

# StudentAttNotFound
source: Student attendance could not be found.
ms: Kehadiran pelajar tidak dijumpai.

# StudentAttUpdateSuccess
source: Student attendance successfully updated.
ms: Kehadiran pelajar berjaya dikemas kini.

# StudentClassExist
source: Student class already exists.
ms: Kelas pelajar sudah didaftarkan.

# StudentClassUpdateSuccess
source: Student class successfully updated.
ms: Kelas pelajar berjaya dikemaskini.

# StudentClsNotFound
source: Student class could not be found.
ms: Kelas pelajar tidak dijumpai.

# StudentClsRemoveSuccess
source: Student class successfully removed.
ms: Kelas pelajar berjaya dikeluarkan.

source: Student Daily Order Report
ms: Laporan Pesanan Harian Pelajar

source: Student Name
ms: Nama Pelajar

# StudentOrderReportNotFound
source: Student daily order report could not be found.
ms: Laporan pesanan harian pelajar tidak dijumpai.

# StudentOrderReportSuccess
source: Student daily order report successfully exported.
ms: Laporan pesanan harian pelajar berjaya dieksport.

# StudentRelationshipNotFound
source: Student relationship could not be found.
ms: Hubungan pelajar tidak dijumpai.

# StudentRelationshipRemoveSuccess
source: Student relationship successfully removed.
ms: Hubungan pelajar berjaya dikeluarkan.

# ThankYouFeedback
source: Your feedback is much appreciated.
ms: Maklum balas anda amat dihargai.

source: Total
ms: Jumlah

# UnauthorizedText
source: 401 - Unauthorized
ms: 401 - Tanpa kebenaran

source: Unit Price
ms: Harga Unit

# UnsufficientWalletBalance
source: Unsufficient e-Wallet balance.
ms: Baki e-Wallet tidak mencukupi.

# UsernameIncorrect
source: Your username is incorrect/not registered.
ms: Nama pengguna anda tidak tepat/tidak didaftarkan.

source: Wrong OTP.
ms: OTP tidak tepat.

source: Year
ms: Tahun

source: Your order has been received.
ms: Pesanan anda telah diterima.

# YourTopupFail
source: Your credit top-up is unsuccessful.
ms: Tambahan nilai kredit anda gagal.

# YourTopupSuccess
source: Your credit top-up is successful.
ms: Tambahan nilai kredit anda berjaya.

# YourTransferFail
source: Your credit transfer is unsuccessful.
ms: Pemindahan nilai credit anda gagal.

# YourTransferSuccess
source: Your credit has been transferred.
ms: Kredit anda telah berjaya dipindahkan.
